{
  "metadata": {
    "generated": "2026-02-05T23:47:19.754Z",
    "totalDescriptions": 281,
    "withDescription": 259,
    "withErrors": 22
  },
  "descriptions": {
    "Empty Frames Initiative": {
      "description": "Based on the limited information available, I cannot determine the specific services or mission of this foster care and child welfare organization from the provided website content.",
      "generatedAt": "2026-02-05T23:33:26.027Z"
    },
    "Crossnore Communities for Children": {
      "description": "Provides holistic trauma-informed care and innovative services to children and families across North Carolina, including foster care, adoption, and family preservation programs.",
      "generatedAt": "2026-02-05T23:40:49.952Z"
    },
    "Keystone Family Alliance - Erie County": {
      "description": "Provides comprehensive child welfare services and support programs for families and children in need throughout Erie County, Pennsylvania.",
      "generatedAt": "2026-02-05T23:30:41.106Z"
    },
    "Keystone Family Alliance - Clarion County": {
      "description": "Based on the limited information provided, I cannot determine the specific foster care or child welfare services offered by this organization, as the website content appears to contain only CSS/technical code rather than descriptive content about their mission or services.",
      "generatedAt": "2026-02-05T23:30:44.452Z"
    },
    "Keystone Family Alliance - Indiana County": {
      "description": "Provides family support services and child welfare programs to strengthen families and protect children in Indiana County, Pennsylvania.",
      "generatedAt": "2026-02-05T23:30:46.875Z"
    },
    "Keystone Family Alliance - Somerset County": {
      "description": "Since the website content appears to be loading code rather than descriptive text, I cannot determine this organization's specific services or mission in the foster care and child welfare space from the provided information.\n\nProvides foster care and child welfare services to families and children in Somerset County, Pennsylvania through community-based support programs.",
      "generatedAt": "2026-02-05T23:30:50.260Z"
    },
    "Keystone Family Alliance - Blair County": {
      "description": "Since the website content provided appears to be CSS code rather than descriptive content about the organization's services, I cannot determine what specific foster care or child welfare services Keystone Family Alliance - Blair County provides based on this information alone.\n\nTo write an accurate one-liner description, I would need actual content about their mission, services, or programs rather than technical website code.",
      "generatedAt": "2026-02-05T23:30:54.133Z"
    },
    "Keystone Family Alliance - Mifflin County": {
      "description": "Provides comprehensive family support services and child welfare programs to strengthen families and protect children in Mifflin County, Pennsylvania.",
      "generatedAt": "2026-02-05T23:30:56.701Z"
    },
    "Keystone Family Alliance - Cumberland County": {
      "description": "I apologize, but the website content provided appears to be CSS/JavaScript code rather than meaningful content about the organization's services. Without access to the actual page content describing Keystone Family Alliance's mission and services, I cannot provide an accurate one-liner description of their foster care and child welfare work.",
      "generatedAt": "2026-02-05T23:31:00.138Z"
    },
    "Keystone Family Alliance - Lancaster County": {
      "description": "Based on the limited information provided, I cannot determine the specific foster care or child welfare services offered by this organization, as the website content appears to only contain CSS code rather than descriptive content about their mission and services.",
      "generatedAt": "2026-02-05T23:31:03.103Z"
    },
    "Keystone Family Alliance - Lehigh County": {
      "description": "Since the website content provided appears to be technical CSS code rather than meaningful information about the organization's services, I cannot determine what specific foster care or child welfare services Keystone Family Alliance - Lehigh County provides based on this data.\n\nTo write an accurate one-liner description, I would need actual content from their website describing their mission, services, or programs related to foster care and child welfare.",
      "generatedAt": "2026-02-05T23:31:06.752Z"
    },
    "Keystone Family Alliance - York County": {
      "description": "Provides comprehensive family support services and child welfare programs to strengthen families and protect children in York County, Pennsylvania.",
      "generatedAt": "2026-02-05T23:31:09.083Z"
    },
    "Keystone Family Alliance - Lebanon County": {
      "description": "Provides comprehensive family support services and child welfare programs to strengthen families and protect children in Lebanon County, Pennsylvania.",
      "generatedAt": "2026-02-05T23:31:11.448Z"
    },
    "The CALL": {
      "description": "Mobilizes Christian churches and communities to recruit, train, and support foster and adoptive families for children in Arkansas foster care.",
      "generatedAt": "2026-02-05T23:31:14.159Z"
    },
    "Project 1.27": {
      "description": "Faith-based organization that recruits, trains, and supports foster and adoptive families while equipping churches to serve children in care.",
      "generatedAt": "2026-02-05T23:31:16.660Z"
    },
    "Embrace Texas": {
      "description": "Provides life-changing programs, support services, and advocacy to vulnerable children in foster care and their caregivers through community partnerships and volunteers.",
      "generatedAt": "2026-02-05T23:31:19.234Z"
    },
    "Project Belong VA": {
      "description": "Equips churches to minister to families and vulnerable children involved in foster care, adoption, and kinship care through comprehensive support programs.",
      "generatedAt": "2026-02-05T23:31:21.768Z"
    },
    "1HOPE": {
      "description": "Unites churches and community members to support foster families through prayer, intentional giving, and compassionate relationship building.",
      "generatedAt": "2026-02-05T23:31:24.139Z"
    },
    "Orphan Care Alliance": {
      "description": "Equips churches and communities to support vulnerable children and families through coaching, advocacy, and family preservation services.",
      "generatedAt": "2026-02-05T23:31:29.015Z"
    },
    "Fostering the Family": {
      "description": "A Christian bridge ministry dedicated to supporting and equipping adoptive and foster families addressing the crisis of orphaned children.",
      "generatedAt": "2026-02-05T23:31:31.940Z"
    },
    "Compass": {
      "description": null,
      "error": "Fetch failed: HTTP 403",
      "generatedAt": "2026-02-05T23:31:32.275Z"
    },
    "Coalition of Care": {
      "description": "Mobilizes churches in Greater Cincinnati to create wraparound support teams for foster, adoptive, and kinship families caring for vulnerable children.",
      "generatedAt": "2026-02-05T23:31:34.649Z"
    },
    "Bennett Chapel": {
      "description": "Church-based foster care ministry providing faith-centered support, resources, and community connections for families involved in the foster care system.",
      "generatedAt": "2026-02-05T23:31:40.735Z"
    },
    "More Than Enough Ministries": {
      "description": "Based on the limited technical website content provided, I cannot determine what specific services More Than Enough Ministries provides in the foster care and child welfare space.",
      "generatedAt": "2026-02-05T23:31:43.732Z"
    },
    "Every Child": {
      "description": "Connects churches, businesses, and community partners through CarePortal to provide resources and support for vulnerable children and families across Western New York.",
      "generatedAt": "2026-02-05T23:31:48.053Z"
    },
    "Foster One": {
      "description": "Empowers families throughout the foster care journey by providing essential resources, parenting classes, and community support to help everyone thrive together.",
      "generatedAt": "2026-02-05T23:31:56.936Z"
    },
    "Redeemed Network (Organization Dissolved)": {
      "description": null,
      "error": "Fetch failed: fetch failed",
      "generatedAt": "2026-02-05T23:31:56.955Z"
    },
    "Restoration225": {
      "description": null,
      "error": "Fetch failed: Request timeout",
      "generatedAt": "2026-02-05T23:32:07.238Z"
    },
    "ABBA Fund - For the Orphan Network": {
      "description": "Educates, equips and empowers churches and individuals to prioritize orphan care while supporting local foster families, reunification efforts, and adoption assistance.",
      "generatedAt": "2026-02-05T23:32:10.995Z"
    },
    "Hands of Hope": {
      "description": "Bridge ministry organization supporting foster care and child welfare initiatives in the Noblesville community through faith-based programs and services.",
      "generatedAt": "2026-02-05T23:32:13.708Z"
    },
    "Grace Church - Eden Prairie": {
      "description": "Supports families pursuing adoption, foster care, and temporary hosting through resources, funding, support groups, mentoring, and at-risk child outreach programs.",
      "generatedAt": "2026-02-05T23:32:17.705Z"
    },
    "Redeemer Church": {
      "description": "Provides child and family advocacy ministry as part of their discipleship and mercy outreach to the Northwest Houston community.",
      "generatedAt": "2026-02-05T23:32:21.198Z"
    },
    "Reaching Higher": {
      "description": "Bridge ministry organization serving the Tulare community by connecting families and youth with supportive resources and mentorship opportunities.",
      "generatedAt": "2026-02-05T23:32:23.972Z"
    },
    "Clement Arts": {
      "description": "Based on the limited information provided, I cannot determine what specific services Clement Arts provides in the foster care/child welfare space, as the website content appears to only show CSS code rather than meaningful content about their mission or services.",
      "generatedAt": "2026-02-05T23:32:27.119Z"
    },
    "Peoples Church": {
      "description": "A racially reconciling church community in Cincinnati that includes care ministries among its various outreach and support services for families.",
      "generatedAt": "2026-02-05T23:32:29.682Z"
    },
    "The Nehemiah Foundation": {
      "description": null,
      "error": "Fetch failed: HTTP 403",
      "generatedAt": "2026-02-05T23:32:30.018Z"
    },
    "Presbyterian Children’s Homes and Services": {
      "description": "Provides Christ-centered foster care, adoption, mentoring, and family support services with data-driven programs focused on nurturing children's strengths and resilience.",
      "generatedAt": "2026-02-05T23:33:06.638Z"
    },
    "CarePortal of Luzerne County": {
      "description": "Connects caring community members and churches with urgent needs of vulnerable children and families through an online platform.",
      "generatedAt": "2026-02-05T23:32:38.387Z"
    },
    "The Fostering Collective": {
      "description": "Connects prospective and active foster/adoptive families with resources, training, and community support through partnerships with agencies and churches in East Texas.",
      "generatedAt": "2026-02-05T23:32:41.008Z"
    },
    "The CALL in Southeast Arkansas": {
      "description": "Mobilizes churches in Southeast Arkansas to support children and youth in foster care through faith-based community engagement and resources.",
      "generatedAt": "2026-02-05T23:32:43.634Z"
    },
    "Nightlight Christian Adoptions": {
      "description": "Provides foster care and adoption services to help families make a positive difference in children's lives through Christian-based placement programs.",
      "generatedAt": "2026-02-05T23:45:38.685Z"
    },
    "CarePortal Arizona": {
      "description": "Connects caring community members and churches to meet urgent needs of vulnerable children and families through an online platform.",
      "generatedAt": "2026-02-05T23:32:51.965Z"
    },
    "Miriam's Heart": {
      "description": "Based on the limited information provided, I cannot determine what specific services Miriam's Heart provides in the foster care and child welfare space, as the website content appears to contain only technical code rather than descriptive information about their mission or programs.",
      "generatedAt": "2026-02-05T23:32:59.142Z"
    },
    "Least of These Carolinas": {
      "description": "Bridges gaps in foster care by providing individualized support and resources to over 16,000 children through volunteer engagement and community partnerships.",
      "generatedAt": "2026-02-05T23:33:01.687Z"
    },
    "CarePortal": {
      "description": "Connects caring communities to meet urgent needs of vulnerable children and families through a technology platform linking volunteers with crisis situations.",
      "generatedAt": "2026-02-05T23:33:09.284Z"
    },
    "Teen Reach": {
      "description": "Equips and empowers churches to establish camp and mentoring programs that provide hope and support to at-risk youth in their communities.",
      "generatedAt": "2026-02-05T23:33:12.513Z"
    },
    "Heart of the Bride Ministries": {
      "description": "Provides adoption aid grants and support services to families while operating bridge ministry programs connecting communities to child welfare needs.",
      "generatedAt": "2026-02-05T23:33:15.295Z"
    },
    "Foster Well": {
      "description": "Connects vulnerable children and families in the foster care system with churches and community members who provide loving, tangible support.",
      "generatedAt": "2026-02-05T23:33:17.954Z"
    },
    "Fruit Cove Baptist Church": {
      "description": "Provides prayer, support groups, wraparound care, mentorship, and resources to raise awareness for vulnerable children and support foster and adoptive families.",
      "generatedAt": "2026-02-05T23:33:23.126Z"
    },
    "Crosspoint Church": {
      "description": "Multi-location church in northwest Florida connecting people to Christ through contemporary and traditional worship, children's ministries, and small group communities.",
      "generatedAt": "2026-02-05T23:44:52.053Z"
    },
    "Father's Heart": {
      "description": "Connects churches and families with foster care resources and support through CarePortal technology and community engagement initiatives.",
      "generatedAt": "2026-02-05T23:33:32.151Z"
    },
    "Focus on the Family": {
      "description": "Provides Christ-centered support and resources to help foster, adoptive, and kinship families build strong, thriving homes for children.",
      "generatedAt": "2026-02-05T23:33:37.445Z"
    },
    "Dwell Orphan Care": {
      "description": "Provides hope and practical support to families in adoption, foster care, and kinship care through grants, resources, and community programs.",
      "generatedAt": "2026-02-05T23:33:40.304Z"
    },
    "Hope Church": {
      "description": "Supports foster families through care communities, support groups, resource centers, and therapeutic programs aimed at reconciliation and restoration for all involved.",
      "generatedAt": "2026-02-05T23:33:44.232Z"
    },
    "HighRidge Church": {
      "description": "A Fort Worth church ministry dedicated to helping people deepen their personal faith while providing community support and encouragement for families.",
      "generatedAt": "2026-02-05T23:33:47.216Z"
    },
    "Hope Local": {
      "description": "Provides framework and customized training to help local churches and faith-based organizations serve vulnerable children and families in their communities.",
      "generatedAt": "2026-02-05T23:33:50.434Z"
    },
    "Foster the City": {
      "description": "Equips churches to recruit and support foster families through training, resources, and digital platforms to create community-based care networks.",
      "generatedAt": "2026-02-05T23:33:53.105Z"
    },
    "FIVE18 Family Services": {
      "description": "Provides family services, counseling, and community resources to build faithful relationships that keep children safe and restore families.",
      "generatedAt": "2026-02-05T23:33:57.196Z"
    },
    "Welcomed": {
      "description": "Provides comprehensive support and resources to foster families through closets, educational courses, and bridge ministry services in Wisconsin.",
      "generatedAt": "2026-02-05T23:34:00.203Z"
    },
    "C.A.R.E. for Hancock": {
      "description": "Provides adoption grants and connects foster care families with local churches while supporting orphan care missions and adoption education.",
      "generatedAt": "2026-02-05T23:34:07.859Z"
    },
    "Christ Community Church": {
      "description": "A church-based foster care ministry connecting volunteers with families to provide support and resources for children in need.",
      "generatedAt": "2026-02-05T23:34:10.648Z"
    },
    "Presbyterian Children's Homes and Services": {
      "description": "Prepares and supports foster and adoptive families in Texas with customized guidance and 24/7 expert access throughout their journey.",
      "generatedAt": "2026-02-05T23:34:53.658Z"
    },
    "Presbyterian Children's Homes and Services & The Foster Care Village": {
      "description": "Prepares and supports foster and adoptive families in Texas with customized guidance and 24/7 expert access to help children in need.",
      "generatedAt": "2026-02-05T23:34:41.201Z"
    },
    "Harvest Family Life Hawaii": {
      "description": "Based on the limited information provided, I cannot determine the specific foster care or child welfare services offered by this Hawaii-based organization.",
      "generatedAt": "2026-02-05T23:34:56.633Z"
    },
    "Flatirons Community Church, West Campus": {
      "description": "Supports global outreach partnerships that strengthen communities and serve vulnerable children and families in overlooked regions worldwide.",
      "generatedAt": "2026-02-05T23:35:00.416Z"
    },
    "For the Sake of One": {
      "description": "Provides comprehensive support to children and families before, during, and after foster care through faith-based services and community partnerships in Texarkana.",
      "generatedAt": "2026-02-05T23:35:04.103Z"
    },
    "Agape of Central Alabama": {
      "description": "A Christian ministry providing adoption, foster care, and pregnancy counseling services to help vulnerable children find permanent homes with nurturing families.",
      "generatedAt": "2026-02-05T23:35:07.585Z"
    },
    "Alabama Baptist Children's Homes": {
      "description": "Provides comprehensive child welfare services including foster care, residential campus care, support for single mothers, and counseling through a faith-based approach.",
      "generatedAt": "2026-02-05T23:35:11.291Z"
    },
    "Lifeline Children's Services": {
      "description": "Equips churches and Christ-centered families to serve vulnerable children through adoption, foster care, pregnancy support, and family preservation ministries.",
      "generatedAt": "2026-02-05T23:35:14.136Z"
    },
    "Third Lens Ministries": {
      "description": "Based on the limited website content available, I cannot determine the specific foster care or child welfare services provided by this Auburn-based ministry organization.",
      "generatedAt": "2026-02-05T23:35:21.223Z"
    },
    "Christian Family Care Agency": {
      "description": "Faith-based agency providing adoption and foster care services, including therapeutic foster care, family counseling, and youth permanency support throughout Arizona.",
      "generatedAt": "2026-02-05T23:35:24.551Z"
    },
    "Arizona 1.27": {
      "description": "Equips churches to recruit, develop, and sustain foster and adoptive families through community support and biblical training programs.",
      "generatedAt": "2026-02-05T23:35:27.449Z"
    },
    "Arizona Baptist Children's Services": {
      "description": "Provides hope and care to hurting children and families through Christ-centered ministries including foster care, counseling, and community support services.",
      "generatedAt": "2026-02-05T23:35:29.703Z"
    },
    "For The Children": {
      "description": "Mobilizes churches to host camps and mentoring programs that create healing moments for children in foster care through faith-based support.",
      "generatedAt": "2026-02-05T23:35:32.680Z"
    },
    "Family Connections Christian Adoptions": {
      "description": "Christian adoption agency affiliated with American Adoptions providing domestic, international, and foster care adoption services with comprehensive birth parent and adoptive family support.",
      "generatedAt": "2026-02-05T23:35:36.051Z"
    },
    "International Christian Adoptions": {
      "description": "Faith-based child placement agency facilitating domestic and international adoptions to connect children with loving permanent families.",
      "generatedAt": "2026-02-05T23:35:42.617Z"
    },
    "Olive Crest": {
      "description": "Provides child abuse prevention services, volunteer host families, and foster-to-adopt programs to create safe homes for children in crisis.",
      "generatedAt": "2026-02-05T23:42:00.771Z"
    },
    "Amaris Ministries": {
      "description": "Provides comprehensive adoption services, birthparent support, and foster care programs with a focus on open adoption and family-centered care.",
      "generatedAt": "2026-02-05T23:35:50.286Z"
    },
    "Pathway Family Services, Inc.": {
      "description": "Provides family-focused services and support programs to strengthen families and improve outcomes for children in the child welfare system.",
      "generatedAt": "2026-02-05T23:35:52.641Z"
    },
    "Teen Leadership Foundation": {
      "description": "Develops leadership skills in at-risk youth aging out of foster care to help them avoid homelessness, incarceration, and other negative outcomes.",
      "generatedAt": "2026-02-05T23:35:55.645Z"
    },
    "ZOE International Ministries": {
      "description": "Combats child trafficking through prevention, rescue, and restoration services while providing restorative care and vocational training for survivors.",
      "generatedAt": "2026-02-05T23:35:59.322Z"
    },
    "Hope's Promise Adoption and Orphan Care": {
      "description": "Provides foster care, adoption, pregnancy counseling, and global orphan care services with comprehensive family support and Christ-centered approach.",
      "generatedAt": "2026-02-05T23:36:02.779Z"
    },
    "Patch Our Planet": {
      "description": "Equips and empowers churches globally to develop custom, long-term orphan care strategies through on-site coaching, online guidance, and multilingual resources.",
      "generatedAt": "2026-02-05T23:36:05.433Z"
    },
    "4KIDS of South Florida": {
      "description": "Provides hope, homes, and healing to children and families in crisis through foster care, therapeutic services, and faith-based community partnerships across South Florida.",
      "generatedAt": "2026-02-05T23:36:08.512Z"
    },
    "One More Child": {
      "description": "Provides Christ-centered foster care services and support for vulnerable children, single mothers, and struggling families through placement, mentoring, and community programs.",
      "generatedAt": "2026-02-05T23:36:11.279Z"
    },
    "Adoption by Shepherd Care": {
      "description": "Provides adoption services in Florida, connecting expectant mothers considering adoption with families seeking to adopt children.",
      "generatedAt": "2026-02-05T23:36:14.764Z"
    },
    "NOMORE Foundation": {
      "description": "Combats poverty, supports orphans, and provides human trafficking awareness and prevention training to protect vulnerable children and families.",
      "generatedAt": "2026-02-05T23:46:12.795Z"
    },
    "WinShape Homes DO NOT PUBLISH (don't want to be on published lists)": {
      "description": "Provides Christ-centered foster care services as part of a broader ministry focused on creating transformational experiences for people at every life stage.",
      "generatedAt": "2026-02-05T23:36:17.828Z"
    },
    "Promise686": {
      "description": "Based on the limited information provided, I cannot determine the specific mission or services this organization provides in the foster care and child welfare space, as the website content excerpt appears incomplete and doesn't contain details about their actual work or programs.",
      "generatedAt": "2026-02-05T23:36:21.633Z"
    },
    "FaithBridge Foster Care": {
      "description": "Christ-centered child placement agency that partners with Georgia churches to recruit and support foster families for children healing from abuse and neglect.",
      "generatedAt": "2026-02-05T23:36:24.629Z"
    },
    "Ignite Hope": {
      "description": "Based on the limited information available, I cannot determine the specific services or mission of this child placement agency from the provided website content, which appears to contain only CSS code.",
      "generatedAt": "2026-02-05T23:36:27.938Z"
    },
    "Open Door Adoption Agency, Inc.": {
      "description": "Provides domestic and international adoption services with personalized counseling and support for birth mothers facing unplanned pregnancies and prospective adoptive families.",
      "generatedAt": "2026-02-05T23:36:30.630Z"
    },
    "Chosen for Life Ministries": {
      "description": null,
      "error": "Fetch failed: fetch failed",
      "generatedAt": "2026-02-05T23:36:30.649Z"
    },
    "Connections Homes": {
      "description": "Connects young adults who aged out of foster care with mentoring families to provide guidance and support for successful futures.",
      "generatedAt": "2026-02-05T23:36:33.290Z"
    },
    "Global Impact International, Inc. (Resoration Rome)": {
      "description": "Mobilizes faith-based communities and stakeholders to transform foster care through innovative preventative models and comprehensive support systems in Rome, Georgia.",
      "generatedAt": "2026-02-05T23:36:36.366Z"
    },
    "Hope 1312 Collective": {
      "description": "Based on the limited website content provided (which appears to be mostly code/technical elements), I cannot determine what specific services Hope 1312 Collective provides in the foster care and child welfare space.\n\nWithout access to meaningful content about their mission, services, or approach, I cannot write an accurate one-liner description. I would need additional information about their actual programs and services to create an appropriate description for the directory.",
      "generatedAt": "2026-02-05T23:36:40.358Z"
    },
    "Lifesong for Orphans": {
      "description": "Provides adoption grants and loans to help families bridge financial gaps in adoption fundraising while supporting orphan care and foster programs.",
      "generatedAt": "2026-02-05T23:36:43.487Z"
    },
    "Hephzibah62:4": {
      "description": "Equips and mobilizes Wesleyan churches to support vulnerable children and families through foster care, adoption, and family preservation ministries.",
      "generatedAt": "2026-02-05T23:36:45.990Z"
    },
    "Emberhope Youthville": {
      "description": "Provides faith-based foster care, adoption services, and residential programs supporting children and families throughout Kansas with therapeutic and kinship care options.",
      "generatedAt": "2026-02-05T23:36:48.741Z"
    },
    "Sunrise Children's Services": {
      "description": "Provides foster care, adoption, and residential treatment services to help heal children and families affected by trauma and abuse.",
      "generatedAt": "2026-02-05T23:36:55.081Z"
    },
    "Bethany Christian Services": {
      "description": "Faith-based organization providing foster care, adoption, family strengthening services, and specialized programs for refugee and immigrant children nationwide.",
      "generatedAt": "2026-02-05T23:46:42.172Z"
    },
    "House of Providence": {
      "description": "Provides therapeutic residential care and community solutions to help foster children and vulnerable families find hope, healing, and stability.",
      "generatedAt": "2026-02-05T23:37:00.650Z"
    },
    "Global Orphan Project, Inc. (GO Project)": {
      "description": "Prevents family breakdown and strengthens vulnerable families worldwide through community-based preventative platforms that address root causes of the orphan cycle.",
      "generatedAt": "2026-02-05T23:37:03.193Z"
    },
    "Palmer Home for Children": {
      "description": "Provides Christ-centered residential care, foster care, and family services for vulnerable children through a trauma-informed approach for over 130 years.",
      "generatedAt": "2026-02-05T23:37:06.067Z"
    },
    "127 Worldwide": {
      "description": "Faith-based organization that connects and equips global Christian communities to collaborate in empowering and supporting vulnerable populations worldwide.",
      "generatedAt": "2026-02-05T23:37:09.455Z"
    },
    "Christian Adoption Services": {
      "description": "Connects vulnerable children with Christian families through domestic and international adoption services, foster care programs, and comprehensive birth mother support.",
      "generatedAt": "2026-02-05T23:37:12.371Z"
    },
    "Pharaoh's Daughters": {
      "description": "I cannot provide a description for this organization's foster care work as their website appears to be a domain for sale rather than an active child welfare organization.",
      "generatedAt": "2026-02-05T23:37:15.382Z"
    },
    "Restored Souls Foundation": {
      "description": "Provides free overnight respite experiences and support to prevent caregiver burnout among foster, adoptive, and special needs families.",
      "generatedAt": "2026-02-05T23:37:18.555Z"
    },
    "A Child's Hope International": {
      "description": "Provides food, clean water, and essential resources to vulnerable children and families in need through international humanitarian efforts.",
      "generatedAt": "2026-02-05T23:37:21.732Z"
    },
    "111 Project": {
      "description": "A faith-based bridge organization connecting churches with foster families to provide unified support and resources in Oklahoma City.",
      "generatedAt": "2026-02-05T23:37:27.300Z"
    },
    "Bair Foundation": {
      "description": "Provides Christian-based foster care, adoption, and kinship services with behavioral health support to strengthen families and children in need.",
      "generatedAt": "2026-02-05T23:37:30.230Z"
    },
    "Love Cradle International": {
      "description": "Serves orphaned and displaced children in Ukraine through humanitarian aid, refugee resettlement assistance, and international missionary support programs.",
      "generatedAt": "2026-02-05T23:37:33.014Z"
    },
    "Fostering Hope New England": {
      "description": "Based on the limited technical content provided, I cannot determine the specific mission or services of this Providence-based bridge organization in the foster care space.",
      "generatedAt": "2026-02-05T23:37:36.458Z"
    },
    "Tennessee Baptist Children's Homes": {
      "description": "Provides Christian foster care training and residential care through family-style homes, welcoming children in hard places with biblical guidance and support.",
      "generatedAt": "2026-02-05T23:37:40.445Z"
    },
    "AGAPE Nashville": {
      "description": "Strengthens children and families through Christ-centered foster care, adoption, maternity care, counseling, and domestic violence services in the Nashville area.",
      "generatedAt": "2026-02-05T23:37:43.435Z"
    },
    "Both Hands Foundation": {
      "description": "Connects adoptive families with community volunteers to raise adoption funds through service projects that help widows with home maintenance and repairs.",
      "generatedAt": "2026-02-05T23:37:46.816Z"
    },
    "Show Hope": {
      "description": "Breaks down barriers between orphaned children and loving families through adoption aid, medical care, and pre and post-adoption support services.",
      "generatedAt": "2026-02-05T23:37:50.140Z"
    },
    "Buckner International Children and Family Services": {
      "description": "Faith-based nonprofit that protects vulnerable children through foster care, adoption, family strengthening services, and support programs rooted in Christian values.",
      "generatedAt": "2026-02-05T23:37:54.517Z"
    },
    "ABBA Fund": {
      "description": "Provides adoption assistance including interest-free loans, crowdfunding support, and charitable funds to help Christian families overcome financial barriers to adoption.",
      "generatedAt": "2026-02-05T23:37:57.466Z"
    },
    "Backyard Orphans": {
      "description": "Helps churches establish foster care, adoption, and support ministries to create lasting positive impact on vulnerable children's lives.",
      "generatedAt": "2026-02-05T23:37:59.725Z"
    },
    "Pathways for Little Feet": {
      "description": "Provides adoption grants and financial assistance to help Christian families cover the costs of bringing children home through adoption.",
      "generatedAt": "2026-02-05T23:38:02.465Z"
    },
    "Phased In": {
      "description": "Supports young adults aging out of foster care with housing, education, job training, and community connections to achieve independence.",
      "generatedAt": "2026-02-05T23:38:05.147Z"
    },
    "One Hope 27": {
      "description": null,
      "error": "Fetch failed: Request timeout",
      "generatedAt": "2026-02-05T23:38:25.153Z"
    },
    "Christian Association of Youth Mentoring": {
      "description": "Provides training and resources to help churches and nonprofits establish safe, effective Christian mentoring programs for vulnerable youth worldwide.",
      "generatedAt": "2026-02-05T23:38:29.354Z"
    },
    "Hope Multiplies": {
      "description": null,
      "error": "Fetch failed: fetch failed",
      "generatedAt": "2026-02-05T23:38:29.440Z"
    },
    "Adoptive and Foster Family Coalition": {
      "description": "Provides support, resources, training, advocacy, and a 24/7 helpline for adoptive, foster, and kinship families throughout New York State.",
      "generatedAt": "2026-02-05T23:38:33.256Z"
    },
    "Release": {
      "description": "Serves youth and families in Omaha through mentoring, foster care, mental health services, and social work since 1994.",
      "generatedAt": "2026-02-05T23:38:35.662Z"
    },
    "Promise686 Montana": {
      "description": "A bridge ministry serving the foster care and child welfare community in Montana through support services and community engagement initiatives.",
      "generatedAt": "2026-02-05T23:38:38.984Z"
    },
    "Every Mother's Advocate": {
      "description": "Provides advocacy, support, and resources to mothers in crisis to prevent family separation and keep children out of foster care.",
      "generatedAt": "2026-02-05T23:38:41.726Z"
    },
    "Wellspring Community Church": {
      "description": "A non-denominational church ministry providing care and support services for foster care, adoption, and families facing unplanned pregnancy situations.",
      "generatedAt": "2026-02-05T23:38:44.896Z"
    },
    "Loudon County Baptist Association": {
      "description": "Based on the limited information provided, I cannot determine what specific foster care or child welfare services this organization provides, as the website content appears to contain only CSS styling code rather than descriptive content about their Bridge Ministry programs.",
      "generatedAt": "2026-02-05T23:38:48.177Z"
    },
    "Calvary Chapel Downey": {
      "description": "Church-based ministry providing faith-centered support, resources, and community connections for families involved in foster care and child welfare services.",
      "generatedAt": "2026-02-05T23:38:51.258Z"
    },
    "Frazer Free Methodist Church": {
      "description": "A Free Methodist church in Montgomery offering community support ministries and care services as part of their mission to help families in need.",
      "generatedAt": "2026-02-05T23:38:54.263Z"
    },
    "Journey Christian Church": {
      "description": "A church ministry providing faith-based support and resources for foster families and children in the child welfare system.",
      "generatedAt": "2026-02-05T23:38:57.233Z"
    },
    "Vintage Church": {
      "description": "A multi-campus church community that welcomes doubters, seekers, and followers while supporting families and children through gospel-centered discipleship and community engagement.",
      "generatedAt": "2026-02-05T23:39:00.134Z"
    },
    "Mosaic Church": {
      "description": "Provides resources and support to families participating in the adoption and foster care journey through their church ministry.",
      "generatedAt": "2026-02-05T23:39:02.978Z"
    },
    "Victory Family Church": {
      "description": null,
      "error": "Fetch failed: fetch failed",
      "generatedAt": "2026-02-05T23:39:03.306Z"
    },
    "Stonegate Church": {
      "description": "Church-based ministry in Midlothian, Texas providing faith-centered support and resources for foster families and children in care.",
      "generatedAt": "2026-02-05T23:39:06.446Z"
    },
    "A Home For Me": {
      "description": "Bridge ministry serving children and families in the foster care system in Simpsonville, South Carolina through faith-based support and resources.",
      "generatedAt": "2026-02-05T23:39:09.494Z"
    },
    "Summerville Baptist Church": {
      "description": "A Baptist church ministry providing faith-based support and services to children and families involved in the foster care system.",
      "generatedAt": "2026-02-05T23:39:15.907Z"
    },
    "The Levi Circle": {
      "description": "Provides spiritual and financial support to families navigating the adoption process through fundraising events and community outreach in Georgia.",
      "generatedAt": "2026-02-05T23:39:22.974Z"
    },
    "Ridgedale Baptist": {
      "description": null,
      "error": "Fetch failed: HTTP 404",
      "generatedAt": "2026-02-05T23:39:25.481Z"
    },
    "The Pearl Project": {
      "description": "Provides trauma-informed training and support through TBRI methodology to help families create healing homes for children who have experienced trauma.",
      "generatedAt": "2026-02-05T23:39:28.695Z"
    },
    "JUST ONE": {
      "description": "I cannot provide an accurate description as the website has moved and contains no information about JUST ONE's foster care or child welfare services.",
      "generatedAt": "2026-02-05T23:39:31.472Z"
    },
    "Spotswood Baptist Church": {
      "description": null,
      "error": "Fetch failed: HTTP 404",
      "generatedAt": "2026-02-05T23:39:32.847Z"
    },
    "Westside Family Church": {
      "description": "Provides comprehensive foster and adoption support through community groups, family events, training, retreats, and volunteer opportunities for Kansas City families.",
      "generatedAt": "2026-02-05T23:39:36.874Z"
    },
    "Calvary Church": {
      "description": "A non-denominational Christian church in Grand Rapids offering orphan care ministry as part of their comprehensive community outreach and mercy programs.",
      "generatedAt": "2026-02-05T23:39:39.231Z"
    },
    "Agape Ranch": {
      "description": "Based on the limited information available, I cannot determine the specific services or mission of Agape Ranch from the provided website content, which appears to only contain CSS styling code rather than descriptive text about their foster care or child welfare programs.",
      "generatedAt": "2026-02-05T23:39:42.526Z"
    },
    "North Coast Church": {
      "description": "Connects families with Olive Crest to provide temporary host homes for children experiencing abuse and neglect cycles.",
      "generatedAt": "2026-02-05T23:39:45.399Z"
    },
    "Foster the Cause in Northwest Kansas": {
      "description": "Bridge ministry connecting churches with foster care by recruiting, training, and supporting Christian foster and adoptive families in Northwest Kansas.",
      "generatedAt": "2026-02-05T23:39:47.948Z"
    },
    "Fostering Great Ideas": {
      "description": "Works to transform and improve the foster care system through innovative approaches and reimagined solutions for children and families.",
      "generatedAt": "2026-02-05T23:39:51.785Z"
    },
    "Southern New Mexico Foster Adoption Ministry": {
      "description": null,
      "error": "Fetch failed: fetch failed",
      "generatedAt": "2026-02-05T23:39:51.804Z"
    },
    "Childplace, Inc.": {
      "description": "Nurtures children and empowers families through comprehensive foster care, adoption services, counseling, and community support programs in southern Indiana.",
      "generatedAt": "2026-02-05T23:39:54.410Z"
    },
    "Justice For Orphans": {
      "description": "Advocates for legal and systemic reforms to protect orphaned and vulnerable children within the child welfare system in New York.",
      "generatedAt": "2026-02-05T23:39:57.207Z"
    },
    "Indiana Kids Belong": {
      "description": "Equips communities with resources and support to improve experiences and outcomes for children navigating Indiana's foster care system.",
      "generatedAt": "2026-02-05T23:40:00.336Z"
    },
    "Help One Child": {
      "description": "Mobilizes community-wide responses to address the foster care crisis through donations and collaborative efforts to support vulnerable children.",
      "generatedAt": "2026-02-05T23:40:03.012Z"
    },
    "Fellowship Greenville": {
      "description": "A Christian church in Greenville, SC that provides foster care ministry and support services to families involved in child welfare.",
      "generatedAt": "2026-02-05T23:40:08.776Z"
    },
    "Love Your Neighbor": {
      "description": "Provides essential items like beds and meals to families in need while building community support through volunteer engagement and donations.",
      "generatedAt": "2026-02-05T23:40:11.603Z"
    },
    "Carolina Care Center": {
      "description": "Based on the limited information provided, I cannot determine what specific services Carolina Care Center provides in the foster care and child welfare space, as the website content only contains technical CSS code without any descriptive information about their mission or services.",
      "generatedAt": "2026-02-05T23:40:14.772Z"
    },
    "The CALL - Arkansas County": {
      "description": "Mobilizes Christian churches to recruit, train, and support foster and adoptive families for children in Arkansas' foster care system.",
      "generatedAt": "2026-02-05T23:40:17.377Z"
    },
    "Choosing Hope Adoptions": {
      "description": "A licensed non-profit adoption agency providing statewide services including infant adoption, special needs adoption, and embryo adoption throughout Ohio.",
      "generatedAt": "2026-02-05T23:40:20.085Z"
    },
    "Joy Meadows": {
      "description": "Provides comprehensive community support for foster families through therapy services, summer camps, clothing assistance, and volunteer networks in the Kansas City area.",
      "generatedAt": "2026-02-05T23:40:22.979Z"
    },
    "SWVA Crossroads Coalition for Orphan and Foster Care": {
      "description": "Unites communities across Southwest Virginia to address the foster care crisis through collaborative support services and resources.",
      "generatedAt": "2026-02-05T23:40:26.076Z"
    },
    "Child Bridge Kalispell": {
      "description": "Finds and supports Montana families to care for children from foster care who have experienced abuse and neglect.",
      "generatedAt": "2026-02-05T23:40:28.581Z"
    },
    "Child Bridge Missoula": {
      "description": "Connects and supports Montana families to care for children from foster care who have experienced abuse and neglect.",
      "generatedAt": "2026-02-05T23:40:31.172Z"
    },
    "Child Bridge Butte": {
      "description": "Connects and supports families to care for Montana children from foster care who have experienced abuse and neglect.",
      "generatedAt": "2026-02-05T23:40:33.569Z"
    },
    "Child Bridge Helena": {
      "description": "Finds and supports families to care for children from Montana's foster care system who have experienced abuse and neglect.",
      "generatedAt": "2026-02-05T23:40:35.975Z"
    },
    "Child Bridge Eastern Montana": {
      "description": "Connects Montana children from foster care with supportive families and provides ongoing resources to help them heal from trauma.",
      "generatedAt": "2026-02-05T23:40:38.820Z"
    },
    "Kentwood Community Church": {
      "description": "Church-based ministry supporting families through foster care, adoption services, family preservation, mentoring, and comprehensive care team support in Kentwood.",
      "generatedAt": "2026-02-05T23:40:42.419Z"
    },
    "Child Bridge Great Falls": {
      "description": "Finds and supports families to care for children from foster care who have experienced abuse and neglect across Montana.",
      "generatedAt": "2026-02-05T23:40:44.670Z"
    },
    "Child Bridge Billings": {
      "description": "Connects and supports families to care for Montana children from foster care who have experienced abuse and neglect.",
      "generatedAt": "2026-02-05T23:40:47.050Z"
    },
    "South Texas Alliance for Orphans": {
      "description": "Mobilizes churches, businesses, and individuals to serve foster families and support youth aging out of care in South Texas.",
      "generatedAt": "2026-02-05T23:40:52.667Z"
    },
    "Fairview Presbyterian": {
      "description": "Presbyterian church ministry dedicated to nurturing lives and supporting families through Christ-centered foster care and child welfare services in North Augusta.",
      "generatedAt": "2026-02-05T23:40:55.554Z"
    },
    "Grace Church - Norton Campus": {
      "description": null,
      "error": "Fetch failed: HTTP 403",
      "generatedAt": "2026-02-05T23:40:55.982Z"
    },
    "Christian Heritage": {
      "description": "Provides foster care placement services in the Lincoln, Nebraska area with a Christian-centered approach to child welfare and family support.",
      "generatedAt": "2026-02-05T23:40:58.404Z"
    },
    "Isaiah's Place Inc.": {
      "description": "Provides placement services for children in need of foster care and adoptive families in the Troy, Ohio area.",
      "generatedAt": "2026-02-05T23:41:01.080Z"
    },
    "ICA": {
      "description": "A placement agency serving the Temecula area that connects children in need with loving families through foster care and adoption services.",
      "generatedAt": "2026-02-05T23:41:03.968Z"
    },
    "BCS Together": {
      "description": "Connects churches and community members to support families in crisis through resource provision, kinship support, and family strengthening programs.",
      "generatedAt": "2026-02-05T23:41:06.843Z"
    },
    "McDowell Church": {
      "description": "Church ministry supporting Arizona's 12,000+ foster children through community partnerships aimed at preventing aging out and breaking cycles of poverty.",
      "generatedAt": "2026-02-05T23:41:10.801Z"
    },
    "Biltmore Church": {
      "description": "A church-based foster care ministry that connects congregation members with local foster care opportunities as part of their community outreach mission.",
      "generatedAt": "2026-02-05T23:41:14.469Z"
    },
    "Haven Hills Foster Care Community": {
      "description": "Creates a supportive residential community for foster families on 80 acres, providing on-site services and resources to improve outcomes for children in care.",
      "generatedAt": "2026-02-05T23:41:20.655Z"
    },
    "AGAPE of North Alabama, Inc.": {
      "description": "Based on the limited information available, I cannot determine the specific services or mission of this placement agency from the provided website content, which appears to contain only technical code.",
      "generatedAt": "2026-02-05T23:41:23.892Z"
    },
    "Congregations for Kids, Inc.": {
      "description": "Mobilizes faith communities to champion foster children through four pathways: fostering, mentoring, serving, and giving to meet urgent needs.",
      "generatedAt": "2026-02-05T23:41:27.493Z"
    },
    "Mission Georgia": {
      "description": "Guides churches to build supportive cultures for foster and adoptive families while providing trauma-informed care training for vulnerable children.",
      "generatedAt": "2026-02-05T23:41:30.017Z"
    },
    "The Sanctuary Foster Care Services": {
      "description": "A Clear Lake-based nonprofit foster care agency specializing in Trust-based Relational Intervention to serve hurting children through placement services and family support.",
      "generatedAt": "2026-02-05T23:41:33.097Z"
    },
    "Resource Center Inc of Ridgeland Mississippi": {
      "description": "Dedicated to meeting the physical and spiritual needs of children and families in the community through comprehensive support services.",
      "generatedAt": "2026-02-05T23:41:36.197Z"
    },
    "Chestnut Mountain Village": {
      "description": "Provides guidance and resources to help churches effectively support foster, adoptive, and vulnerable children and families in their communities.",
      "generatedAt": "2026-02-05T23:41:38.564Z"
    },
    "Emmanuel Faith Community Church": {
      "description": "Church ministry supporting foster and adoptive families through care communities, host family programs, respite nights, and parent support groups.",
      "generatedAt": "2026-02-05T23:41:42.414Z"
    },
    "Rooftop Church": {
      "description": "A vibrant non-denominational church in Affton providing faith-based support and community resources for families involved in foster care ministry.",
      "generatedAt": "2026-02-05T23:41:45.210Z"
    },
    "Flourishing Families of South Carolina": {
      "description": "Provides support, training, and family coaching using Trust-Based Relational Intervention to help families affected by childhood trauma heal and flourish.",
      "generatedAt": "2026-02-05T23:41:47.962Z"
    },
    "Fostering Connections": {
      "description": "Supports North Alabama foster, adoptive, and kinship families with essential items, community connections, and identity-building experiences through faith-based services.",
      "generatedAt": "2026-02-05T23:41:50.660Z"
    },
    "Georgia Kids Belong": {
      "description": "Equips communities across Georgia with resources and support to improve experiences and outcomes for children in foster care.",
      "generatedAt": "2026-02-05T23:42:03.742Z"
    },
    "Colorado Kids Belong": {
      "description": "Equips communities with resources and support to improve experiences and outcomes for children in Colorado's foster care system.",
      "generatedAt": "2026-02-05T23:42:06.982Z"
    },
    "Camelot Community Care": {
      "description": "Serves children and families experiencing abuse, neglect, and behavioral health issues through foster care services and family support programs.",
      "generatedAt": "2026-02-05T23:42:09.272Z"
    },
    "Tennessee Kids Belong": {
      "description": "Works to improve experiences and outcomes for children in Tennessee's foster care system through advocacy and support initiatives.",
      "generatedAt": "2026-02-05T23:42:11.892Z"
    },
    "Chosen": {
      "description": "Provided support services and resources to adoptive, foster, kinship, and reunified families to help children heal from trauma through strengthened family connections.",
      "generatedAt": "2026-02-05T23:42:14.679Z"
    },
    "ICA - Institute for Children's Aid Counseling Center": {
      "description": "Provides counseling and therapeutic services to support children and families involved in the child welfare system in Southern California.",
      "generatedAt": "2026-02-05T23:42:17.479Z"
    },
    "The Alliance: Defending the Cause of Kids & Families": {
      "description": "Based on the limited information provided, I cannot determine the specific services or mission of this organization in the foster care/child welfare space. The website content appears to only contain CSS code rather than descriptive content about their programs or services.\n\nTo write an accurate one-liner description, I would need additional information about:\n- Their specific foster care or child welfare services\n- Their mission statement\n- Program descriptions\n- Target population served\n\nCould you provide more substantive content from their website or other sources about their actual work in foster care and child welfare?",
      "generatedAt": "2026-02-05T23:42:22.249Z"
    },
    "Mid-Atlantic Orphan Care Coalition": {
      "description": null,
      "error": "Fetch failed: HTTP 403",
      "generatedAt": "2026-02-05T23:42:22.611Z"
    },
    "Keystone Family Alliance": {
      "description": "Unfortunately, the website content provided appears to be CSS/technical code rather than descriptive content about the organization's mission or services, making it impossible to determine their specific role in foster care and child welfare.",
      "generatedAt": "2026-02-05T23:42:26.067Z"
    },
    "Fostering Hope Austin": {
      "description": "Provides support, training, and resources to foster and adoptive families while helping churches develop ministries for children from hard places.",
      "generatedAt": "2026-02-05T23:42:30.266Z"
    },
    "The Resurrection Center Church": {
      "description": "Bible-based church in Wilmington offering community engagement ministries and empowerment programs to support families and children in need.",
      "generatedAt": "2026-02-05T23:42:43.993Z"
    },
    "4KIDS": {
      "description": "Provides hope, homes, and healing to children and families in crisis through foster care, therapeutic services, and faith-based community partnerships across South Florida.",
      "generatedAt": "2026-02-05T23:42:47.469Z"
    },
    "4KIDS Miami": {
      "description": "Provides loving Christian foster homes for children in Miami-Dade County while keeping siblings together and offering prevention and therapy services.",
      "generatedAt": "2026-02-05T23:42:50.028Z"
    },
    "4KIDS Palm Beach": {
      "description": "Provides loving Christian foster homes for children in Palm Beach County while offering prevention services and therapy to keep families together.",
      "generatedAt": "2026-02-05T23:42:52.689Z"
    },
    "4KIDS Treasure Coast": {
      "description": "Provides loving Christian homes for foster children across four Treasure Coast counties while offering prevention and therapy services to keep families together.",
      "generatedAt": "2026-02-05T23:42:55.487Z"
    },
    "4KIDS Southwest Florida": {
      "description": null,
      "error": "Fetch failed: HTTP 404",
      "generatedAt": "2026-02-05T23:42:56.065Z"
    },
    "Nebraska 117": {
      "description": "Provides support and resources to help foster families succeed and thrive in their caregiving journey.",
      "generatedAt": "2026-02-05T23:42:59.310Z"
    },
    "Oakland Church": {
      "description": "A Rochester church community focused on following Jesus, growing together, and serving others with unique gifts to change the world through Christ's love.",
      "generatedAt": "2026-02-05T23:43:02.725Z"
    },
    "Hope Bridge": {
      "description": "Mobilizes churches and communities to advocate for Ohio foster care system reform while supporting foster, adoptive, and kinship families.",
      "generatedAt": "2026-02-05T23:43:05.473Z"
    },
    "Fostering Family Ministries": {
      "description": "Engages churches to recruit and support foster families through partnerships, training, and community resources to ensure every child has a loving home.",
      "generatedAt": "2026-02-05T23:43:08.637Z"
    },
    "Wildwood Collective (an initiative of Wildwood Hills Ranch)": {
      "description": "Provides healing and hope to at-risk children and youth through full-scholarship summer programming, leadership development, and equestrian therapy services.",
      "generatedAt": "2026-02-05T23:43:12.866Z"
    },
    "Foster Pantry, Inc": {
      "description": "Provides essential supplies and resources to foster families to help them care for children in need.",
      "generatedAt": "2026-02-05T23:43:15.722Z"
    },
    "The Local Church of Grand Rapids": {
      "description": "A Grand Rapids church community that follows Jesus through tangible service, including foster care ministry support for local families and children in need.",
      "generatedAt": "2026-02-05T23:43:18.559Z"
    },
    "Acts 2 Impact": {
      "description": null,
      "error": "Fetch failed: Request timeout",
      "generatedAt": "2026-02-05T23:43:28.903Z"
    },
    "Indiana Mentor": {
      "description": null,
      "error": "Fetch failed: HTTP 403",
      "generatedAt": "2026-02-05T23:43:29.561Z"
    },
    "Harvestime": {
      "description": "Multi-campus church ministry providing faith-based support and community resources for families involved in foster care and child welfare services.",
      "generatedAt": "2026-02-05T23:43:32.252Z"
    },
    "McLean Bible Church - Prince William Campus": {
      "description": "A multi-generational church family in Manassas providing faith-based support and community connections for children and families in need.",
      "generatedAt": "2026-02-05T23:43:34.923Z"
    },
    "Homes of Hope": {
      "description": "Provides comprehensive support services for foster families and children, including caregiver resources, scholarships, counseling, and community events.",
      "generatedAt": "2026-02-05T23:43:37.838Z"
    },
    "Connect South Central Tennessee": {
      "description": "Supports social workers in their vital work serving children and families in the child welfare system across South Central Tennessee.",
      "generatedAt": "2026-02-05T23:43:41.336Z"
    },
    "Tennessee Alliance For Kids": {
      "description": "Engages the community to meet emergent needs of children in foster care, those entering care, and youth aging out of the system.",
      "generatedAt": "2026-02-05T23:43:44.011Z"
    },
    "Worthy & Known Family Project": {
      "description": "Provides training, consultation, and direct services to families and child welfare systems using trauma-informed approaches to support children and caregivers.",
      "generatedAt": "2026-02-05T23:46:06.857Z"
    },
    "Fostering Hope": {
      "description": "Provides comprehensive support and encouragement to the foster care community through resources for children, foster parents, and agency workers.",
      "generatedAt": "2026-02-05T23:43:50.124Z"
    },
    "Release Inc.": {
      "description": "Serves youth and families in Omaha through mentoring, foster care, mental health services, and social work since 1994.",
      "generatedAt": "2026-02-05T23:43:52.210Z"
    },
    "East Cooper Baptist Church": {
      "description": "Based on the provided website content, I cannot find any specific information about foster care or child welfare services offered by this organization. The website appears to focus on general church activities, worship services, and community programs, but does not mention foster care ministry despite being categorized as such in the directory.\n\nWithout clear evidence of foster care services on their website, I cannot write an accurate one-liner description of their foster care/child welfare work.",
      "generatedAt": "2026-02-05T23:43:57.300Z"
    },
    "Kehila Park": {
      "description": null,
      "error": "Fetch failed: Request cannot be constructed from a URL that includes credentials: https://kehilapark@gmail.com",
      "generatedAt": "2026-02-05T23:43:57.305Z"
    },
    "ECHO Family Care Partners": {
      "description": "Provides bridge ministry services supporting children and families in the foster care system through faith-based care and community partnerships.",
      "generatedAt": "2026-02-05T23:44:00.083Z"
    },
    "StoryConnect": {
      "description": "Based on the limited information provided, I cannot determine what specific services StoryConnect provides in the foster care and child welfare space, as the website content appears to contain only technical CSS code rather than descriptive content about their mission or services.",
      "generatedAt": "2026-02-05T23:44:03.396Z"
    },
    "McLean Bible Church - Montgomery County": {
      "description": "Church community serving diverse Montgomery County families with children's programming and special needs support through contemporary worship and local outreach ministries.",
      "generatedAt": "2026-02-05T23:44:06.011Z"
    },
    "Ohio Kids First": {
      "description": "Advocates for policy changes and funding to build sustainable early childhood systems that support Ohio children's development and potential.",
      "generatedAt": "2026-02-05T23:44:08.840Z"
    },
    "Raleigh's Place": {
      "description": "Christ-centered foster care ministry providing partner homes, summer camps, transitional living apartments, and resources to support children and families in Alabama.",
      "generatedAt": "2026-02-05T23:44:11.231Z"
    },
    "Child Bridge": {
      "description": "Montana-based nonprofit that finds and supports families to care for children from foster care who have experienced abuse and neglect.",
      "generatedAt": "2026-02-05T23:44:13.809Z"
    },
    "Dwelling Place Texas": {
      "description": null,
      "error": "Fetch failed: Request timeout",
      "generatedAt": "2026-02-05T23:44:33.822Z"
    },
    "Radiant Church": {
      "description": "Based on the website content provided, I cannot find any specific information about foster care or child welfare services offered by Radiant Church. The content focuses on general church ministries, worship services, prayer groups, children's ministry, and youth programs, but does not mention foster care, adoption, or child welfare activities.\n\nWithout clear evidence of foster care ministry on their website, I cannot write an accurate one-liner description of their foster care services. You may want to contact the organization directly or find additional sources that specifically detail their foster care ministry activities.",
      "generatedAt": "2026-02-05T23:44:38.547Z"
    },
    "Cornerstone Church of Ames": {
      "description": "Church ministry supporting foster care and adoption services through faith-based programs and community resources for families in Ames, Iowa.",
      "generatedAt": "2026-02-05T23:44:40.929Z"
    },
    "Four Oaks": {
      "description": "Connects Iowa families with foster care and adoption opportunities, providing support and guidance throughout the placement process for children in need.",
      "generatedAt": "2026-02-05T23:44:46.040Z"
    },
    "Foster SQUAD": {
      "description": "Provides support and resources to foster families in Polk County, Iowa to help them navigate their foster care journey.",
      "generatedAt": "2026-02-05T23:44:48.815Z"
    },
    "Church on Bayshore": {
      "description": "A church-based foster care ministry providing faith-centered support and resources to families involved in the foster care system.",
      "generatedAt": "2026-02-05T23:44:54.876Z"
    },
    "Generations United Church": {
      "description": "A church ministry in Niceville providing faith-based support and resources for foster families and children in need through their comprehensive care programs.",
      "generatedAt": "2026-02-05T23:44:58.132Z"
    },
    "Agape of NC": {
      "description": "Provides professional foster care and adoption services as a compassionate Christian outreach to strengthen families throughout North Carolina.",
      "generatedAt": "2026-02-05T23:45:00.363Z"
    },
    "Second Home RDU": {
      "description": "Provides support network for foster, adoptive, and kinship families in Raleigh-Durham through support groups, resource closets, and community mobilization.",
      "generatedAt": "2026-02-05T23:45:04.173Z"
    },
    "Sustaining Hope for High Impact Parents (SHHIP)": {
      "description": "Provides support and resources to parents navigating the challenges of raising children with complex mental health conditions.",
      "generatedAt": "2026-02-05T23:45:06.269Z"
    },
    "Summit Church Collaborative": {
      "description": "Provides support group ministry for families pursuing adoption or fostering, current foster and adoptive families, and adult adoptees within their church community.",
      "generatedAt": "2026-02-05T23:45:09.608Z"
    },
    "Seven Homes": {
      "description": "Provides foster care and adoption services in North Carolina with comprehensive training, ongoing support, and strong community connections for families.",
      "generatedAt": "2026-02-05T23:45:12.424Z"
    },
    "King's Table Church": {
      "description": "Church ministry in Raleigh supporting families through foster care and adoption services within their faith community.",
      "generatedAt": "2026-02-05T23:45:15.338Z"
    },
    "Church at Station Hill": {
      "description": "Spring Hill church ministry providing foster care and adoption support services to families in the community through faith-based guidance and involvement opportunities.",
      "generatedAt": "2026-02-05T23:45:18.510Z"
    },
    "Apex Community Services": {
      "description": "Provides foster care services and support to help families become foster parents in Nebraska, with offices in Omaha and Hastings.",
      "generatedAt": "2026-02-05T23:45:21.767Z"
    },
    "The Core Omaha": {
      "description": "Provides faith-based counseling, mentoring, grief support, and educational services to help individuals and families work through life challenges and improve well-being.",
      "generatedAt": "2026-02-05T23:45:25.435Z"
    },
    "F to A Bridge": {
      "description": "Bridges the gap from fostering to adoption by providing resources and TBRI training to strengthen adoptive families and prevent placement disruptions.",
      "generatedAt": "2026-02-05T23:45:27.825Z"
    },
    "Faith Bridge": {
      "description": "I cannot provide an accurate description of Faith Bridge's foster care and child welfare services as the website content provided only contains technical code rather than information about their mission or programs.",
      "generatedAt": "2026-02-05T23:45:31.311Z"
    },
    "Rooted242": {
      "description": "Since the website content is not available (N/A for all fields), I cannot provide an accurate description of Rooted242's specific mission or services in the foster care/child welfare space. To write an appropriate one-liner, I would need access to their website content, mission statement, or information about their programs and services.",
      "generatedAt": "2026-02-05T23:45:35.165Z"
    },
    "Northern Colorado Christian Alliance for Orphans": {
      "description": null,
      "error": "Fetch failed: fetch failed",
      "generatedAt": "2026-02-05T23:45:36.044Z"
    },
    "Foster Alight": {
      "description": "Provides supportive services and resources to foster families and children in the child welfare system in the Loveland, Colorado area.",
      "generatedAt": "2026-02-05T23:45:41.449Z"
    },
    "Maple Star Colorado": {
      "description": "Provides foster care services, behavioral health support, and family assistance programs across multiple states including Colorado.",
      "generatedAt": "2026-02-05T23:45:44.502Z"
    },
    "Timberline Church": {
      "description": "A welcoming church community in Windsor providing family support, local outreach, and faith-based programs to help families grow and connect together.",
      "generatedAt": "2026-02-05T23:45:48.001Z"
    },
    "Camp Rock of Georgia": {
      "description": "Based on the limited information available, I cannot determine what specific foster care or child welfare services Camp Rock of Georgia provides, as the website content is mostly technical code without descriptive text about their mission or programs.",
      "generatedAt": "2026-02-05T23:45:53.121Z"
    },
    "The Church at Remerton": {
      "description": "Based on the website content provided, I cannot find any specific information about foster care or child welfare services offered by The Church at Remerton. The website appears to focus on general church services, worship, community outreach, and educational programs like English and Spanish classes, but does not mention foster care ministry, child welfare programs, or related services.\n\nWithout clear evidence of foster care or child welfare activities, I cannot accurately write a one-liner description for this organization in that category.",
      "generatedAt": "2026-02-05T23:45:58.300Z"
    },
    "MG Empowerment Center": {
      "description": null,
      "error": "Fetch failed: fetch failed",
      "generatedAt": "2026-02-05T23:45:58.432Z"
    },
    "Avon Park Lakes Baptist Church": {
      "description": "A Baptist church ministry providing faith-based support and resources for foster families and children in need within their community.",
      "generatedAt": "2026-02-05T23:46:01.291Z"
    },
    "South Oak Church": {
      "description": "First Baptist church in Lake Placid providing faith-based support and ministry services for families involved in foster care and child welfare.",
      "generatedAt": "2026-02-05T23:46:03.975Z"
    },
    "Curtis Lake Church": {
      "description": "A church community in Sanford, Maine providing faith-based support and ministry services for families involved in foster care and child welfare.",
      "generatedAt": "2026-02-05T23:46:09.291Z"
    },
    "McLean Bible Church - Tysons Campus": {
      "description": "Multi-location church family serving the greater Washington DC area with a mission to make disciples among all nations and welcome everyone.",
      "generatedAt": "2026-02-05T23:46:15.550Z"
    },
    "Good Shepherd": {
      "description": "I apologize, but the website content provided appears to be CSS/styling code rather than meaningful information about Good Shepherd's foster care and child welfare services. Without access to the actual content describing their mission, services, or programs, I cannot create an accurate one-liner description of what this organization does in the foster care/child welfare space.\n\nTo write an effective description, I would need information such as:\n- Their mission statement\n- Types of services they provide\n- Target population they serve\n- Their approach to foster care/child welfare\n\nCould you provide the actual website content or program information for Good Shepherd?",
      "generatedAt": "2026-02-05T23:46:19.823Z"
    },
    "Four Oaks Church - Killearn": {
      "description": "A church-based ministry in Tallahassee providing faith-centered support and resources for families involved in foster care and child welfare services.",
      "generatedAt": "2026-02-05T23:46:23.533Z"
    },
    "Appalachian Impact": {
      "description": "Provides hope-building programs and support services for at-risk students in the Appalachian region through after-school activities and community engagement.",
      "generatedAt": "2026-02-05T23:46:26.709Z"
    },
    "New Community Church": {
      "description": "Looking at the website content provided, I don't see any specific information about foster care or child welfare services offered by New Community Church. The website content focuses on general church services, worship times, house churches, and community programs, but doesn't mention foster care ministry, adoption services, or child welfare programs.\n\nWithout clear information about their foster care or child welfare activities, I cannot write an accurate one-liner description for this organization's work in that space. More specific information about their foster care ministry would be needed to create an appropriate description.",
      "generatedAt": "2026-02-05T23:46:32.325Z"
    },
    "Explore the New Manufacturing": {
      "description": "I cannot provide a one-liner description for this organization's foster care/child welfare work because Explore the New Manufacturing is focused exclusively on manufacturing career education for West Virginia students, not foster care or child welfare services.",
      "generatedAt": "2026-02-05T23:46:36.133Z"
    },
    "Crossroads Bible Church": {
      "description": "A church-based ministry in Grand Rapids providing faith-centered support and resources for families involved in foster care and adoption.",
      "generatedAt": "2026-02-05T23:46:39.853Z"
    },
    "CMA Church of Morgantown": {
      "description": "A Christian and Missionary Alliance church in Morgantown providing faith-based support and ministry services for foster families and children in care.",
      "generatedAt": "2026-02-05T23:46:44.764Z"
    },
    "Chestnut Ridge Church": {
      "description": "Church ministry supporting foster families and children in the child welfare system through community connection, resources, and faith-based care initiatives.",
      "generatedAt": "2026-02-05T23:46:47.685Z"
    },
    "Calvary Baptist Church": {
      "description": "A Hurricane, WV Baptist church providing hope and family connection through faith-based ministries that welcome and support children and families in need.",
      "generatedAt": "2026-02-05T23:46:52.014Z"
    },
    "Mission Point Community Church": {
      "description": "A church ministry supporting families and children through care services, advocacy programs, and community partnerships in the Warsaw area.",
      "generatedAt": "2026-02-05T23:46:54.948Z"
    },
    "Warsaw Community Church": {
      "description": null,
      "error": "Fetch failed: HTTP 403",
      "generatedAt": "2026-02-05T23:46:55.272Z"
    },
    "Community Grace Brethren Church": {
      "description": "A welcoming church ministry in Warsaw providing faith-based support and resources for foster families and children in the community.",
      "generatedAt": "2026-02-05T23:46:57.969Z"
    },
    "Faith Church": {
      "description": "A Bible-believing church community committed to restoring relationships and supporting families through faith-based care and outreach ministries across multiple locations.",
      "generatedAt": "2026-02-05T23:47:01.013Z"
    },
    "Flourish Church": {
      "description": "A church ministry in Gary, Indiana that supports foster families and children through faith-based community engagement and spiritual guidance programs.",
      "generatedAt": "2026-02-05T23:47:04.188Z"
    },
    "Tamarisk Community": {
      "description": "Provides support, friendship, and opportunities for young adults aging out of foster care in Raleigh to successfully transition to independence.",
      "generatedAt": "2026-02-05T23:47:07.362Z"
    },
    "Grace Church": {
      "description": "Multi-campus church in the Greenville area dedicated to making mature followers of Jesus Christ through discipleship and community engagement.",
      "generatedAt": "2026-02-05T23:47:11.716Z"
    },
    "Young Masterbuilders In Motion, Inc.": {
      "description": "Based on the limited information provided, I cannot determine this organization's specific role in foster care or child welfare services, as the website content is incomplete and doesn't describe their mission or services.",
      "generatedAt": "2026-02-05T23:47:15.781Z"
    },
    "Family Hope Coalition": {
      "description": null,
      "error": "Fetch failed: HTTP 403",
      "generatedAt": "2026-02-05T23:47:16.001Z"
    },
    "Bay Area Chinese Bible Church": {
      "description": "A Chinese Bible church in Alameda providing care ministries and local outreach services to support children and families in the community.",
      "generatedAt": "2026-02-05T23:47:19.753Z"
    }
  }
}